{
    "message": "hello i18n !!",
    "nav": {
        "recruitment": "Recruitment",
        "tech": "Tech",
        "corporate": "Corporate",
        "education": "Education",
        "telemarketing": "Telemarketing",
        "singleAgent": "Single Agent",
        "multipleAgent": "Multiple Agent",
        "bundle": "Bundle",
        "callCenter": "Call Center",
        "english": "English",
        "chinese": "Chinese",
        "getInTouch": "Get In Touch",
        "facebook": "Facebook",
        "instagram": "Instagram",
        "blog": "Blog",
        "language": "Language"
    },
    "intro": {
        "whoWeAre": "Who We Are",
        "teazeapEstablished": "Teazeap was established as a comprehensive provider of",
        "recruitment": "recruitment",
        "telemarketing": "telemarketing",
        "and": "and",
        "callCenter": "call center",
        "services": "services.",
        "recognizingDemand": "Recognizing the growing demand for skilled professionals in the tech, corporate, and educational sectors, Teazeap set out to connect businesses with top talent.",
        "teazeapSetOut": "With a mission to bridge the gap between employers and exceptional candidates, Teazeap has achieved significant accomplishments through innovative strategies and personalized approaches.",
        "teazeapHasAchieved": "Teazeap has successfully facilitated numerous placements, contributing to the growth and success of client organizations.",
        "teazeapHasSuccessfully": "Teazeap remains committed to its mission of delivering exceptional recruitment solutions and outstanding customer experiences in the years to come.",
        "withAMission": "With a mission to bridge the gap between employers and exceptional candidates,",
        "teazeapRemainsCommitted": "Teazeap remains committed to its mission of delivering exceptional recruitment solutions and outstanding customer experiences in the years to come."

    },
    "products": {
        "explore": "Explore the world of Teazeap"
    },
    "team": {
        "ourTeam": "Our Team"
    },
    "banner": {
        "teazeapAgency": "Teazeap Agency",
        "transformingWorkforce": "Transforming your workforce and customer interactions with Teazeap's innovative recruitment, telemarketing, and call center solutions.",
        "recruitment": "Recruitment",
        "telemarketing": "Telemarketing",
        "callCenter": "Call Center"
    },
    "recruitmentPage": {
        "revolutionizingRecruitment": "Revolutionizing Recruitment in Tech, Corporate and Education.",
        "introText": "In today's highly competitive job market, finding top talent that perfectly aligns with your organization's needs and values is no easy feat. That's where Teazeap steps in, redefining the landscape of recruitment in the tech, corporate, and educational sectors. As a leading recruiting company, Teazeap is dedicated to providing innovative solutions that bridge the gap between exceptional talent and forward-thinking organizations. With a distinct focus on these three sectors, Teazeap combines cutting-edge technology, industry expertise, and a passion for connecting professionals with their dream careers.",
        "stepsTitle": "Our Strategic Approach To Providing Recruitment Services",
        "processes": {
            "1": {
                "title": "TARGETED EXPERTISE FOR SPECIALIZED SECTORS",
                "content": "Our industry-focused recruitment experts possess deep knowledge in tech, corporate, and educational sectors, enabling us to identify top talent and seamlessly align them with our clients' specific requirements."
            },
            "2": {
                "title": "INNOVATIVE TECH FOR EFFICIENT OPERATIONS",
                "content": "Leveraging innovative tools, AI, and data analytics, we streamline recruitment processes, reducing time-to-hire and providing our clients with a competitive edge in accessing qualified talent efficiently."
            },
            "3": {
                "title": "PERSONALIZED APPROACH FOR TAILORED CONNECTIONS",
                "content": "Understanding the unique values and aspirations of candidates and clients, we forge meaningful connections, offering tailored recommendations that drive long-term success and foster strong relationships for mutual growth and fulfillment."
            }
        },
        "startedTitle": "Where we started",
        "startedContent": "Teazeap embarked on its journey with a primary emphasis on talent acquisition within the educational sector. However, over time, the organization evolved into a well-rounded provider of recruitment solutions, telemarketing services, and call center operations. Teazeap's expanded scope encompassed various types of teaching professionals, including full-time educators, part-time instructors, and substitute teachers.",
        "strategicProcess": "Our Strategic  Recruitment Process",
        "applyNow": "Apply Now",
        "createProfile": "Create Profile"
    },
    "serviceIndustry": {
        "tech": {
            "name": "Tech",
            "description": "Teazeap's prowess in the tech industry stems from its ability to curate a network of top-tier tech talent, ensuring a competitive edge in the recruitment landscape. By staying at the forefront of industry trends and leveraging extensive industry knowledge, Teazeap consistently identifies exceptional candidates with specialized technical expertise. Its rigorous screening processes not only evaluate technical prowess but also assess cultural fit, resulting in optimal candidate placements for businesses seeking innovation and technological excellence. Companies we have worked with include <span style='font-weight: bold'>MetroFuser</span> and <span style='font-weight: bold'>SoundCloud</span>."
        },
        "corporate": {
            "name": "Corporate",
            "description": "Teazeap excels in the corporate industry by customizing recruitment solutions to meet each corporation's specific needs. With a deep understanding of corporate requirements and a proven track record, Teazeap successfully places qualified professionals in executive, managerial, and administrative positions. Notably, Teazeap has collaborated with industry-leading companies such as <span style='font-weight: bold'> United Debt Settlement</span>, <span style='font-weight: bold'>Singulus LLC</span>, and <span style='font-weight: bold'>Gotham Ltd</span> leveraging its comprehensive database and proactive sourcing techniques to connect them with candidates possessing the ideal qualifications, experience, and leadership skills that align with their unique cultures and strategic objectives."
        },
        "educational": {
            "name": "Education",
            "description": "Teazeap's leadership in the education industry stems from its profound comprehension of the unique needs of educational institutions and its ability to connect them with highly qualified professionals. Whether schools require academic staff, administrative personnel, or specialized educators, Teazeap possesses the expertise to identify the ideal candidates. Notably, Teazeap has successfully partnered with renowned schools such as <span style='font-weight: bold'>Ailyn English School</span>, <span style='font-weight: bold'>Kang Chiao School</span>, and <span style='font-weight: bold'>Yoder Bilingual Academy</span>, leveraging its extensive network and sector knowledge to consistently match these institutions with qualified individuals who possess the requisite qualifications, experience, and passion for cultivating enriching learning environments and promoting academic excellence."
        }
    },
    "header": {
        "header": "Recruiting Agency",
        "subHeader": "Unlock Your Career Potential with Teazeap: Connecting Exceptional Talent with Tech, Corporate, and Education Opportunities!",
        "applyNow": "Apply Now",
        "teachingJobs": "Teaching Jobs",
        "significant": "We highly value your teaching career and its significance to us",
        "teachers": "Teachers",
        "profileSubHeader": "Your teaching career is very important to us"
    },
    "viewJob": "View Job",









    "landing-page": {
        "who": "Who we are",
        "goals": "TeaZeaP services guarantee schools are connected and provided with the best school teachers. Full time, part time, and substitute teacher positions are available.TeaZeaP is here to support our partners. In addition to job placements our team is available to mediate between schools and teachers. This may include communicating, clarifying or solving any potential misunderstandings between the two parties. Mentorship and helpful resources are readily available to teachers.",
        "full-time": "Full time Teacher",
        "full-time-desc": "Reliable and trustworthy teachers that are committed to working in harmony with their school full time in order to provide a fun and safe learning environment for students.",
        "part-time": "Part time Teacher",
        "part-time-desc": "Reliable and trustworthy teachers that are committed to working in harmony with their school part time in order to provide a fun and safe learning environment for students.",
        "sub-teacher": "Sub Teacher",
        "sub-desc": "Reliable, and trustworthy teachers open to fill in when requested by a school and willing to meet their needs.",
        "team": "Here is our team",
        "chief": "Founder and CEO",
        "chief-quote": "“It takes 20 years to build a reputation and five minutes to ruin it. If you think about that, you’ll do things differently.”",
        "project": "Co-founder and COO",
        "project-quote": "“As you navigate through the rest of your life, be open to collaboration. Other people and other people’s ideas are often better than your own.” ",
        "comm": "Co-founder and CCO",
        "comm-quote": "“Without publicity there can be no public support, and without public support every nation must decay.”",
        "telemarketing": "Telemarketing",
        "telemarketing-desc": "Maximize your sales potential with our expert telemarketing and call center services with price less than $10/agent",
        "recruitment": "Recruitment",
        "recruitment-desc": "Unlock Your Career Potential with Teazeap: Connecting Exceptional Talent with Tech, Corporate, and Education Opportunities!",
        "call-center": "Call Center",
        "call-center-desc": "Elevating Customer Experience with Exceptional Call Center Services for Businesses Worldwide!"
    },
    "contact": {
        "with-us": "Want to work with us?",
        "get-in-touch": "Get in Touch with Us",
        "important": "Your teaching career is very important to us.",
        "reach-out": "Reach Out to Our Expert Team",
        "name": "First Name...",
        "full-name": "Full Name...",
        "email": "Email Here...",
        "type": "Type a message...",
        "send": "Send Message",
        "cancel": "Cancel"
    },
    "teachers": {
        "find": "Finding Your Next Job",
        "success": "Your success is important to us. TeaZeaP has curated partnerships with various employers looking to fill full-time, part-time, and substitute teacher positions. Through our platform you will be promoted as a candidate for a number of openings. If your resume is a good match for our clients’ needs, a recruiter will reach out to you to ensure the opportunity fits your goals and preferences. From there, our team will prepare you for every step of the hiring process, from the interview to placement. And even in helping you get settled in the apartment and city, you would like. We would have one of our team members accompany you all along the way.",
        "testimonials": "Testimonials"
    },
    "schools": {
        "find": "Finding Your Next Teacher",
        "success": " TeaZeaP services guarantee schools are connected and provided with the best school teachers. We will help them find the right full time, part-time, or substitute teacher at the time needed. TeaZeaP is here to support our partners. In addition to job placements our team is available to mediate between schools and teachers. This may include communicating, clarifying or solving any potential misunderstandings between the two parties. Mentorship and helpful resources are readily available to teachers. And besides our services go further, we even have the option of going abroad to the country of choice of the schools to fetch the right teachers for them.",
        "jobs": "Current Jobs",
        "clients": "Clients",
        "schools": "Schools",
        "no-jobs": "Jobs Currently Unavailable"
    },
    "blog": {
        "no-blogs": "No Blogs"
    },
    "testimonials": "Testimonials"
}